// Створіть масив styles з елементами «Джаз» та «Блюз».
// Додайте "Рок-н-рол" в кінець.
// Замініть значення всередині на «Класика». Ваш код для пошуку значення 
// всередині повинен працювати для масивів з будь-якою довжиною.
// Видаліть перший елемент масиву та покажіть його.
// Вставте «Реп» та «Реггі» на початок масиву.

document.write("<h3>Створіть масив styles з елементами «Джаз» та «Блюз»</h3>");

const styles = ["Джаз", "Блюз"];
document.write(styles);

document.write("<h3>Додайте «Рок-н-рол» в кінець</h3>");

styles.push("Рок-н-рол");
document.write(styles);

document.write("<h3>Замініть значення всередині на «Класика». Ваш код для пошуку значення всередині повинен працювати для масивів з будь-якою довжиною</h3>");

styles.splice(1,1, "Класика");
document.write(styles);

document.write("<h3>Видаліть перший елемент масиву та покажіть його</h3>");

styles.shift();
document.write(styles);

document.write("<h3>Вставте «Реп» та «Реггі» на початок масиву</h3>");

styles.unshift("Реп", "Реггі");
document.write(styles);